	
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Билет(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Билет)
	Макет = ПолучитьМакет("Билет");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаБилетов.Номер,
		|	ПродажаБилетов.Дата,
		|	ПродажаБилетов.Номенклатура
		|	ПродажаБилетов.Номенклатура.КоличествоПосещений КАК КоличествоПосещений,
		|	ПродажаБилетов.СуммаДокумента
		|ИЗ
		|	Документ.ПродажаБилетов КАК ПродажаБилетов
		|ГДЕ
		|	ПродажаБилетов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		
		ПараметрыОбласти = Новый Структура();
		ПараметрыОбласти.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D;"));
		ПараметрыОбласти.Вставить("Номер", УдалитьЛидирующиеНули(Выборка.Номер));
	
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбласти);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция УдалитьЛидирующиеНули(Номер)
	Результат = Номер;
	Пока СтрНачинаетсяС(Результат, "0") Цикл
		Результат = Сред(Результат, 2);
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Процедура ПеренестиНоменклатуруВТабличнуюЧасть() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаБилетов.Ссылка
		|ИЗ
		|	Документ.ПродажаБилетов КАК ПродажаБилетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПродажаБилетов.ПозицииПродажи КАК ПродажаБилетовПозицииПродажи
		|		ПО ПродажаБилетовПозицииПродажи.Ссылка = ПродажаБилетов.Ссылка
		|		И ПродажаБилетовПозицииПродажи.НомерСтроки = 1
		|ГДЕ
		|	ПродажаБилетов.УдалитьНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ПродажаБилетовПозицииПродажи.Ссылка ЕСТЬ NULL";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Строка = ДокОбъект.ПозицииПродажи.Добавить();
			Строка.Номенклатура = ДокОбъект.УдалитьНоменклатура;
			Строка.Цена = ДокОбъект.УдалитьЦена;
			Строка.Количество = 1;
			Строка.Сумма = Строка.Цена;
			
			ДокОбъект.ОбменДанными.Загрузка = Истина;
			ДокОбъект.Записать();			
		КонецЦикла;
		
КонецПроцедуры

