
//@skip-check module-structure-method-in-regions
&НаСервере
Процедура УправлениеВидимостьюПолей()
	
	ЭтоПосещениеАттракциона = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеАттракциона);
	Элементы.ВидАттракциона.Видимость = ЭтоПосещениеАттракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАттракциона;
		
КонецПроцедуры

//@skip-check module-structure-method-in-regions
&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	УправлениеВидимостьюПолей();

КонецПроцедуры


//@skip-check module-structure-method-in-regions
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостьюПолей();	
	
КонецПроцедуры




