
&НаКлиенте
Процедура ПозицииПродажиНоменклатураПриИзменении(Элемент)

	СтрокаТЧ = Элементы.ПозицииПродажи.ТекущиеДанные;
	СтрокаТЧ.Цена = ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура, Объект.Дата);
	
	РассчитатьСуммуТЧ(СтрокаТЧ);	

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.Цена = ПолучитьЦенуНоменклатуры(Объект.УдалитьНоменклатура, Объект.Дата);	
	РассчитатьСуммуДокумента();	

КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)

	РассчитатьСуммуДокумента();	

КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	Объект.БаллыКСписанию = Объект.ПозицииПродажи.Итог("Сумма") - Объект.СуммаДокумента;	

КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.ПозицииПродажи.Итог("Сумма") - Объект.БаллыКСписанию;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();	

КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуТЧ(СтрокаТЧ)
	
	СтрокаТЧ = Элементы.ПозицииПродажи.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиЦенаПриИзменении(Элемент)

	СтрокаТЧ = Элементы.ПозицииПродажи.ТекущиеДанные;
	РассчитатьСуммуТЧ(СтрокаТЧ);	

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПродажиКоличествоПриИзменении(Элемент)
	
	СтрокаТЧ = Элементы.ПозицииПродажи.ТекущиеДанные;
	РассчитатьСуммуТЧ(СтрокаТЧ);	

КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура, Период)
	
	Возврат РегистрыСведений.ЦеныНоменклатуры.ЦенаНоменклатуры(Номенклатура, Период);
	
КонецФункции


